; domain
(define (domain grid)
(:requirements :strips :constraints)
(:predicates (pred_8 ?v13 ?v3)
             (pred_7 ?v1 ?v12)
             (pred_6 ?v13 ?v12)
             (pred_2 ?v10 ?v13 )
	     (pred_1 ?v13)
             (pred_10 ?v6)
             (pred_5 ?v1)
             (pred_9 ?v12)
             (pred_11 ?v13)
             (pred_12 ?v1)
             (pred_3 ?v13)
             (pred_4 ))



(:action op_5
:parameters (?v5 ?v8 ?v9 ?v11)
:precondition (and (pred_10 ?v5) (pred_10 ?v8) (pred_5 ?v9) (pred_9 ?v11)
          (pred_8 ?v5 ?v8) (pred_7 ?v9 ?v11)
                   (pred_6 ?v8 ?v11) (pred_1 ?v5) 
                   (pred_11 ?v8) (pred_12 ?v9))
:effect (and  (pred_3 ?v8) (not (pred_11 ?v8))))


(:action op_1
:parameters (?v5 ?v2)
:precondition (and (pred_10 ?v5) (pred_10 ?v2)
               (pred_1 ?v5) (pred_8 ?v5 ?v2) (pred_3 ?v2))
:effect (and (pred_1 ?v2) (not (pred_1 ?v5))))

(:action op_4
:parameters (?v5 ?v9)
:precondition (and (pred_10 ?v5) (pred_5 ?v9) 
                  (pred_1 ?v5) (pred_2 ?v9 ?v5) (pred_4 ))
:effect (and (pred_12 ?v9)
   (not (pred_2 ?v9 ?v5)) (not (pred_4 ))))


(:action op_3
:parameters (?v5 ?v4 ?v7)
:precondition (and (pred_10 ?v5) (pred_5 ?v4) (pred_5 ?v7)
                  (pred_1 ?v5) (pred_12 ?v7) (pred_2 ?v4 ?v5))
:effect (and (pred_12 ?v4) (pred_2 ?v7 ?v5)
        (not (pred_12 ?v7)) (not (pred_2 ?v4 ?v5))))

(:action op_2
:parameters (?v5 ?v9)
:precondition (and (pred_10 ?v5) (pred_5 ?v9) 
                  (pred_1 ?v5) (pred_12 ?v9))
:effect (and (pred_4 ) (pred_2 ?v9 ?v5) (not (pred_12 ?v9)))))

; problem
(define (problem grid-4-4-2-3-3)
    (:domain grid)
    (:objects
    obj_04 obj_16 obj_03 obj_18 obj_06 obj_21 obj_10 obj_12 obj_17 obj_13 obj_02 obj_11 obj_01 obj_05 obj_15 obj_14
    obj_09 obj_07
    obj_20 obj_19 obj_08
    )

    (:init
       (pred_4)

       (pred_10 obj_04)
       (pred_10 obj_16)
       (pred_10 obj_03)
       (pred_10 obj_18)
       (pred_10 obj_06)
       (pred_10 obj_21)
       (pred_10 obj_10)
       (pred_10 obj_12)
       (pred_10 obj_17)
       (pred_10 obj_13)
       (pred_10 obj_02)
       (pred_10 obj_11)
       (pred_10 obj_01)
       (pred_10 obj_05)
       (pred_10 obj_15)
       (pred_10 obj_14)
       (pred_9 obj_09)
       (pred_9 obj_07)
       (pred_5 obj_20)
       (pred_5 obj_19)
       (pred_5 obj_08)

       (pred_8 obj_04 obj_06)
       (pred_8 obj_04 obj_16)
       (pred_8 obj_16 obj_21)
       (pred_8 obj_16 obj_03)
       (pred_8 obj_16 obj_04)
       (pred_8 obj_03 obj_10)
       (pred_8 obj_03 obj_18)
       (pred_8 obj_03 obj_16)
       (pred_8 obj_18 obj_12)
       (pred_8 obj_18 obj_03)
       (pred_8 obj_06 obj_17)
       (pred_8 obj_06 obj_21)
       (pred_8 obj_06 obj_04)
       (pred_8 obj_21 obj_13)
       (pred_8 obj_21 obj_10)
       (pred_8 obj_21 obj_16)
       (pred_8 obj_21 obj_06)
       (pred_8 obj_10 obj_02)
       (pred_8 obj_10 obj_12)
       (pred_8 obj_10 obj_03)
       (pred_8 obj_10 obj_21)
       (pred_8 obj_12 obj_11)
       (pred_8 obj_12 obj_18)
       (pred_8 obj_12 obj_10)
       (pred_8 obj_17 obj_01)
       (pred_8 obj_17 obj_13)
       (pred_8 obj_17 obj_06)
       (pred_8 obj_13 obj_05)
       (pred_8 obj_13 obj_02)
       (pred_8 obj_13 obj_21)
       (pred_8 obj_13 obj_17)
       (pred_8 obj_02 obj_15)
       (pred_8 obj_02 obj_11)
       (pred_8 obj_02 obj_10)
       (pred_8 obj_02 obj_13)
       (pred_8 obj_11 obj_14)
       (pred_8 obj_11 obj_12)
       (pred_8 obj_11 obj_02)
       (pred_8 obj_01 obj_05)
       (pred_8 obj_01 obj_17)
       (pred_8 obj_05 obj_15)
       (pred_8 obj_05 obj_13)
       (pred_8 obj_05 obj_01)
       (pred_8 obj_15 obj_14)
       (pred_8 obj_15 obj_02)
       (pred_8 obj_15 obj_05)
       (pred_8 obj_14 obj_11)
       (pred_8 obj_14 obj_15)
       (pred_11 obj_06)
       (pred_11 obj_03)
       (pred_11 obj_01)
       (pred_6  obj_06 obj_09)
       (pred_6  obj_03 obj_07)
       (pred_6  obj_01 obj_09)
       (pred_3 obj_04)
       (pred_3 obj_16)
       (pred_3 obj_18)
       (pred_3 obj_21)
       (pred_3 obj_10)
       (pred_3 obj_12)
       (pred_3 obj_17)
       (pred_3 obj_13)
       (pred_3 obj_02)
       (pred_3 obj_11)
       (pred_3 obj_05)
       (pred_3 obj_15)
       (pred_3 obj_14)

       (pred_7  obj_20 obj_09)
       (pred_7  obj_19 obj_07)
       (pred_7  obj_08 obj_09)
       (pred_2 obj_20 obj_18)
       (pred_2 obj_19 obj_10)
       (pred_2 obj_08 obj_12)
       (pred_1 obj_14)
    )

    (:goal (and
       (pred_2 obj_20 obj_04)
    ))
(:constraints
  (always (not (pred_1 obj_11)))
)
)

; plan
1. (op_1 obj_14 obj_15)
   deleted: (pred_1 obj_14)
   added: (pred_1 obj_15)
   goals met: 0 of 1
2. (op_1 obj_15 obj_02)
   deleted: (pred_1 obj_15)
   added: (pred_1 obj_02)
   goals met: 0 of 1
3. (op_1 obj_02 obj_10)
   deleted: (pred_1 obj_02)
   added: (pred_1 obj_10)
   goals met: 0 of 1
4. (op_1 obj_10 obj_12)
   deleted: (pred_1 obj_10)
   added: (pred_1 obj_12)
   goals met: 0 of 1
5. (op_1 obj_12 obj_18)
   deleted: (pred_1 obj_12)
   added: (pred_1 obj_18)
   goals met: 0 of 1
6. (op_4 obj_18 obj_20)
   deleted: (pred_2 obj_20 obj_18) (pred_4)
   added: (pred_12 obj_20)
   goals met: 0 of 1
7. (op_1 obj_18 obj_12)
   deleted: (pred_1 obj_18)
   added: (pred_1 obj_12)
   goals met: 0 of 1
8. (op_1 obj_12 obj_10)
   deleted: (pred_1 obj_12)
   added: (pred_1 obj_10)
   goals met: 0 of 1
9. (op_1 obj_10 obj_21)
   deleted: (pred_1 obj_10)
   added: (pred_1 obj_21)
   goals met: 0 of 1
10. (op_1 obj_21 obj_16)
   deleted: (pred_1 obj_21)
   added: (pred_1 obj_16)
   goals met: 0 of 1
11. (op_1 obj_16 obj_04)
   deleted: (pred_1 obj_16)
   added: (pred_1 obj_04)
   goals met: 0 of 1
12. (op_2 obj_04 obj_20)
   deleted: (pred_12 obj_20)
   added: (pred_4) (pred_2 obj_20 obj_04)
   goals met: 1 of 1
